# Analise de planilhas de vendas

In [1]:
# Importação dos pacotes necessa´rios
import pandas as pd
import seaborn as sn
import matplotlib.pyplot as plt

In [2]:
# Carregando cada planilha em um dataframe diferenre
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

In [3]:
#usando método de conctenação para junção dos dataframes criados
df_lojas = pd.concat([df1,df2,df3,df4,df5])

In [5]:
# Verificando as primeiras limhas do df_lojas
df_lojas.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [6]:
# Verificndo as 5 últimas linhas do df_lojas
df_lojas.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [7]:
# verificando linhas aleatórias do df_lojas
df_lojas.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
175      Natal 2019-01-02   16.53    1036     2
24   Fortaleza 2019-01-01   35.38    1005     4
18       Natal 2019-03-14  581.00     853     3
97   Fortaleza 2019-01-01  139.70    1003     4
74    Salvador 2019-01-01  170.53    1035     2

In [8]:
# Verificando o tipo de dado de cada coluna
df_lojas.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object